podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/LTC0_MKW41Z4.svd.xml
<!--
Devices using this peripheral: 
      MKW41Z4
-->
      <peripheral>
         <?sourceFile "LTC0_MKW41Z4" ?>
         <name>LTC0</name>
         <description>LP Trusted Cryptography</description>
         <groupName>LTC</groupName>
         <headerStructName>LTC</headerStructName>
         <baseAddress>0x40058000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x8</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x10</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x18</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x30</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x34</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x40</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x48</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x58</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x100</offset>
            <size>0x38</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x200</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x4F0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x7C0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x7E0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x7F0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MD</name>
               <description>Mode Register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>ENC</name>
                     <description>EThis bit selects encryption or decryption</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Decrypt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Encrypt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ICV_TEST</name>
                     <description>ICV Checking / Test AES fault detection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AS</name>
                     <description>Algorithm State</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Update</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Initialize</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Finalize</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Initialize/Finalize</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AAI</name>
                     <description>Additional Algorithm information</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>ALG</name>
                     <description>Algorithm. This field specifies which algorithm is being selected</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00010000</name>
                           <description>AES</description>
                           <value>0b10000</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>KS</name>
               <description>Key Size Register</description>
               <addressOffset>0x8</addressOffset>
               <access>write-only</access>
               <resetValue>0x10</resetValue>
               <fields>
                  <field>
                     <name>KS</name>
                     <description>Key Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DS</name>
               <description>Data Size Register</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>DS</name>
                     <description>Data Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICVS</name>
               <description>ICV Size Register</description>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>ICVS</name>
                     <description>ICV Size, in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>COM</name>
               <description>Command Register</description>
               <addressOffset>0x30</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ALL</name>
                     <description>Reset All Internal Logic</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Do Not Reset</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset all CHAs in use by this CCB</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AES</name>
                     <description>Reset AESA. Writing a 1 to this bit resets the AES Accelerator core engine</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Do Not Reset</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset AES Accelerator</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL</name>
               <description>Control Register</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>IM</name>
                     <description>Interrupt Mask.\nOnce this bit is set, it can only be cleared by hard reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt not masked</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt masked</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IFE</name>
                     <description>Input FIFO DMA Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DMA Request and Done signals disabled for the Input FIFO</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DMA Request and Done signals enabled for the Input FIFO</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IFR</name>
                     <description>Input FIFO DMA Request Size</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DMA request size is 1 entry</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DMA request size is 4 entries</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OFE</name>
                     <description>Output FIFO DMA Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DMA Request and Done signals disabled for the Output FIFO</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DMA Request and Done signals enabled for the Output FIFO</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="IFR" > <name>OFR</name> <description>Output FIFO DMA Request Size</description> <bitOffset>13</bitOffset> </field>
                  <field>
                     <name>IFS</name>
                     <description>Input FIFO Byte Swap.\n
Byte swap all data that is written to the Input FIFO</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Do Not Byte Swap Data</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Byte Swap Data</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="IFS" > <name>OFS</name> <description>Output FIFO Byte Swap</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="IFS" > <name>KIS</name> <description>Key Register Input Byte Swap</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="IFS" > <name>KOS</name> <description>Key Register Output Byte Swap</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="IFS" > <name>CIS</name> <description>Context Register Input Byte Swap</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="IFS" > <name>COS</name> <description>Context Register Output Byte Swap</description> <bitOffset>23</bitOffset> </field>
                  <field>
                     <name>KAL</name>
                     <description>Key Register Access Lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Key Register is readable</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Key Register is not readable</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CW</name>
               <description>Clear Written Register</description>
               <addressOffset>0x40</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CM</name>
                     <description>Clear the Mode Register. Writing a one to this bit causes the Mode Register to be cleared</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CDS</name>
                     <description>Clear the Data Size Register</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CICV</name>
                     <description>Clear the ICV Size Register. Writing a one to this bit causes the ICV Size Register to be cleared</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCR</name>
                     <description>Clear the Context Register. Writing a one to this bit causes the Context Register to be cleared</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKR</name>
                     <description>Clear the Key Register</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COF</name>
                     <description>Clear Output FIFO. Writing a 1 to this bit causes the Output FIFO to be cleared</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CIF</name>
                     <description>Clear Input FIFO. Writing a 1 to this bit causes the Input Data FIFO</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STA</name>
               <description>Status Register</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>AB</name>
                     <description>AESA Busy</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>AESA Idle</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>AESA Busy</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DI</name>
                     <description>Done Interrupt</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EI</name>
                     <description>Error Interrupt</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Not Error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Error Interrupt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
