podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/LTC0_MKW41Z4.svd.xml
            <register>
               <name>ESTA</name>
               <description>Error Status Register</description>
               <addressOffset>0x4C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRID1</name>
                     <description>Error ID 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0001</name>
                           <description>Mode Error</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>Data Size Error</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0011</name>
                           <description>Key Size Error</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0110</name>
                           <description>Data Arrived out of Sequence Error</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1010</name>
                           <description>ICV Check Failed</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1011</name>
                           <description>Internal Hardware Failure</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1100</name>
                           <description>CCM AAD Size Error (either 1. AAD flag in B0 =1 and no AAD type provided, 2. AAD flag in B0 = 0 and AAD povided, or 3. AAD flag in B0 =1 and not enough AAD provided - expecting more based on AAD size.)</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1111</name>
                           <description>Invalid Crypto Engine Selected</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CL1</name>
                     <description>algorithms.\n
The algorithms field indicates which algorithm is asserting an error. Others reserved</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0000</name>
                           <description>General Error</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0001</name>
                           <description>AES</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>AADSZ</name>
               <description>AAD Size Register</description>
               <addressOffset>0x58</addressOffset>
               <fields>
                  <field>
                     <name>AADSZ</name>
                     <description>AAD size in Bytes, mod 16</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AL</name>
                     <description>AAD Last</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>14</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13</dimIndex>
               <name>CTX%s</name>
               <description>Context Register</description>
               <addressOffset>0x100</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>CTX</name>
                     <description>CTX</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>KEY%s</name>
               <description>Key</description>
               <addressOffset>0x200</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>KEY</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>VID1</name>
               <description>Version ID Register</description>
               <addressOffset>0x4F0</addressOffset>
               <access>read-only</access>
               <resetValue>0x340100</resetValue>
               <fields>
                  <field>
                     <name>MIN_REV</name>
                     <description>Minor revision number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MAJ_REV</name>
                     <description>Major revision number</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IP_ID</name>
                     <description>ID(0x0034)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VID2</name>
               <description>Version ID 2 Register</description>
               <addressOffset>0x4F4</addressOffset>
               <access>read-only</access>
               <resetValue>0x101</resetValue>
               <fields>
                  <field>
                     <name>ECO_REV</name>
                     <description>ECO revision number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ARCH_ERA</name>
                     <description>Architectural ERA</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHAVID</name>
               <description>CHA Version ID Register</description>
               <addressOffset>0x4F8</addressOffset>
               <access>read-only</access>
               <resetValue>0x50</resetValue>
               <fields>
                  <field>
                     <name>AESREV</name>
                     <description>AES Revision Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AESVID</name>
                     <description>AES Version ID</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FIFOSTA</name>
               <description>FIFO Status Register</description>
               <addressOffset>0x7C0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>IFL</name>
                     <description>Input FIFO Level. These bits indicate the current number of entries in the Input FIFO</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>IFF</name>
                     <description>Input FIFO Full. The Input FIFO is full and should not be written to</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFL</name>
                     <description>Output FIFO Level. These bits indicate the current number of entries in the Output FIFO</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFF</name>
                     <description>Output FIFO Full. The Output FIFO is full and should not be written to</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IFIFO</name>
               <description>Input Data FIFO</description>
               <addressOffset>0x7E0</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>IFIFO</name>
                     <description>IFIFO</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>OFIFO</name>
               <description>Output Data FIFO</description>
               <addressOffset>0x7F0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>OFIFO</name>
                     <description>Output FIFO</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
